tap "hashicorp/tap"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "shopify/shopify"
brew "bat"
brew "fastfetch"
brew "fish"
brew "fzf"
brew "gh"
brew "gnupg"
brew "hcloud"
brew "jq"
brew "kubernetes-cli"
brew "lua"
brew "make"
brew "neovim"
brew "node@20"
brew "pipx"
brew "python@3.12"
brew "redis"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "shopify/shopify/shopify-cli"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "alfred"
cask "anydesk"
cask "arc"
cask "bartender"
cask "chatgpt"
cask "cleanmymac"
cask "cleanshot"
cask "cloudflare-warp"
cask "cryptomator"
cask "discord"
cask "docker"
cask "dropbox"
cask "font-jetbrains-mono"
cask "gemini"
cask "ghostty"
cask "gitkraken"
cask "hammerspoon"
cask "hazel"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-word"
cask "monitorcontrol"
cask "ngrok"
cask "notion"
cask "permute"
cask "postman"
cask "redis-insight"
cask "rocket-typist"
cask "screen-studio"
cask "signal"
cask "slack"
cask "spotify"
cask "thunderbird"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shopify.theme-check-vscode"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
