tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "shopify/shopify"
tap "shopware/tap"
brew "awscli"
brew "bat"
brew "borgbackup"
brew "php"
brew "composer"
brew "fastfetch"
brew "fish"
brew "fzf"
brew "gh"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "hcloud"
brew "imagemagick"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "lua"
brew "make"
brew "maven"
brew "neovim"
brew "node@22"
brew "pipx"
brew "python@3.12"
brew "redis"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "shopify/shopify/shopify-cli"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "alfred"
cask "anydesk"
cask "arc"
cask "bartender"
cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "cleanshot"
cask "cloudflare-warp"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "font-jetbrains-mono"
cask "gemini"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "hammerspoon"
cask "hazel"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-word"
cask "ngrok/ngrok/ngrok"
cask "notion"
cask "permute"
cask "postman"
cask "redis-insight"
cask "screen-studio"
cask "shopware/tap/shopware-cli"
cask "signal"
cask "slack"
cask "spotify"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"
vscode "anthropic.claude-code"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "jetbrains.qodana-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shopify.theme-check-vscode"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
