tap "domt4/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/bundle"
tap "jetbrains/utils", trusted: true
tap "ngrok/ngrok", trusted: true
tap "shopify/shopify", trusted: true
tap "shopware/tap", trusted: true
brew "awscli"
brew "bat"
brew "borgbackup"
brew "php"
brew "composer"
brew "lua"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "gnupg"
brew "openjdk"
brew "gradle"
brew "hcloud"
brew "imagemagick"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "make"
brew "maven"
brew "media-info"
brew "mkcert"
brew "neovim"
brew "node@22"
brew "pipx"
brew "poppler"
brew "python@3.12"
brew "redis"
brew "sox"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "zig"
brew "zoxide"
brew "hashicorp/tap/terraform", trusted: true
brew "jetbrains/utils/teamcity", trusted: true
brew "shopify/shopify/shopify-cli", trusted: true
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "alfred"
cask "arc"
cask "bartender"
cask "claude"
cask "claude-code@latest"
cask "cleanmymac"
cask "cleanshot"
cask "cloudflare-warp"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "font-jetbrains-mono"
cask "gemini"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "hammerspoon"
cask "hazel"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mountain-duck"
cask "ngrok/ngrok/ngrok"
cask "openlogi"
cask "parallels"
cask "permute"
cask "postman"
cask "raspberry-pi-imager"
cask "redis-insight"
cask "screen-studio"
cask "shopware/tap/shopware-cli"
cask "slack"
cask "spotify"
cask "tableplus"
cask "telegram"
cask "transmit"
cask "unifi-identity-endpoint"
cask "vlc"
cask "whatsapp"
cask "yubico-authenticator"
cask "zed"
cask "zoom"
npm "@openai/codex"
npm "corepack"
npm "prettier"
